In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
musicbox_conn = sql.connect("../data/musicbox.sqlite")
musicbox_conn.text_factory = str

In [3]:
pd.read_sql("SELECT * FROM sqlite_master", musicbox_conn)

,type,name,tbl_name,rootpage,sql
0,table,Down,Down,3,"CREATE TABLE Down(\n uid INT,\n device TEXT,..."
1,table,Play,Play,4,"CREATE TABLE Play(\n uid INT,\n device TEXT,..."
2,index,song_id_index,Play,6,CREATE INDEX song_id_index ON Play (song_id)
3,index,songid_songlength_idx,Play,5,CREATE INDEX songid_songlength_idx ON Play (so...
4,table,song_info,song_info,7,"CREATE TABLE ""song_info"" (\n""song_id"" REAL,\n ..."
5,index,song_id_name_idx,song_info,8,CREATE INDEX song_id_name_idx ON song_info(son...
6,table,Play_new,Play_new,9,"CREATE TABLE Play_new(\n uid INT,\n device T..."
7,index,date_uid_idx,Play_new,10,"CREATE INDEX date_uid_idx ON Play_new (date, uid)"

In [4]:
pd.read_sql("SELECT * FROM Play_new LIMIT 5", musicbox_conn)

   uid device  song_id song_name singer  play_time  song_length        date
0    0     ar      0.0       花雨    張清    40384.0        297.0  2017-04-08
1    0     ar      0.0       花雨    張清     4974.0        297.0  2017-04-08
2    0     ar      0.0       花雨    張清    40384.0        297.0  2017-04-08
3    0     ar      0.0       花雨    張清     4974.0        297.0  2017-04-08
4    0     ar      0.0       花雨    張清    40384.0        297.0  2017-04-08

In [6]:
pd.read_sql("SELECT COUNT(*) FROM Play_new", musicbox_conn)

    COUNT(*)
0  163589120

In [7]:
pd.read_sql("SELECT COUNT(*) FROM Play", musicbox_conn)

    COUNT(*)
0  164400821

In [37]:
# extremely large play_time
# first aggregate date per day, but would be problematic when deal with average play percentage
"""
SELECT
    uid, device,
    SUM(CASE WHEN date BETWEEN '2017-03-30' AND '2017-04-09' THEN freq ELSE NULL END) AS w1_freq,
    SUM(CASE WHEN date BETWEEN '2017-03-30' AND '2017-04-09' THEN total_play_time ELSE NULL END) AS w1_play_time,

    SUM(CASE WHEN date BETWEEN '2017-04-10' AND '2017-04-20' THEN freq ELSE NULL END) AS w2_freq,
    SUM(CASE WHEN date BETWEEN '2017-04-10' AND '2017-04-20' THEN total_play_time ELSE NULL END) AS w2_play_time,
    
    SUM(CASE WHEN date BETWEEN '2017-04-21' AND '2017-05-01' THEN freq ELSE NULL END) AS w3_freq,
    SUM(CASE WHEN date BETWEEN '2017-04-21' AND '2017-05-01' THEN total_play_time ELSE NULL END) AS w3_play_time,
    
    SUM(CASE WHEN date BETWEEN '2017-05-02' AND '2017-05-12' THEN freq ELSE NULL END) AS w4_freq,
    SUM(CASE WHEN date BETWEEN '2017-05-02' AND '2017-05-12' THEN total_play_time ELSE NULL END) AS w4_play_time,
FROM
    (
    SELECT 
        uid, date, device
        COUNT(1) AS freq, 
        SUM(play_time) AS total_play_time,
        SUM(CASE WHEN play_time / song_length  > 1 THEN 1.0 ELSE play_time / song_length END) AS sum_daily_play_pct,
    FROM Play
    GROUP BY 1, 2 
    ) sub
GROUP BY
    1
"""

CPU times: user 4.87 s, sys: 226 ms, total: 5.09 s
Wall time: 5.12 s

In [8]:
%%time
musicbox_conn.execute("CREATE INDEX date_uid_idx ON Play_new (date, uid);")

CPU times: user 8min 46s, sys: 39 s, total: 9min 25s
Wall time: 10min 47s

In [5]:
%%time
churn_df = pd.read_sql("""
SELECT
    uid, device,
    SUM(CASE WHEN time_window = 'w1' THEN freq ELSE NULL END) AS freq_w1,
    SUM(CASE WHEN time_window = 'w1' THEN total_play_time ELSE NULL END) AS play_time_w1,
    SUM(CASE WHEN time_window = 'w1' THEN avg_play_pct ELSE NULL END) AS avg_play_pct_w1,
    
    SUM(CASE WHEN time_window = 'w2' THEN freq ELSE NULL END) AS freq_w2,
    SUM(CASE WHEN time_window = 'w2' THEN total_play_time ELSE NULL END) AS play_time_w2,
    SUM(CASE WHEN time_window = 'w2' THEN avg_play_pct ELSE NULL END) AS avg_play_pct_w2,
    
    SUM(CASE WHEN time_window = 'w3' THEN freq ELSE NULL END) AS freq_w3,
    SUM(CASE WHEN time_window = 'w3' THEN total_play_time ELSE NULL END) AS play_time_w3,
    SUM(CASE WHEN time_window = 'w3' THEN avg_play_pct ELSE NULL END) AS avg_play_pct_w3,
    
    SUM(CASE WHEN time_window = 'w4' THEN freq ELSE NULL END) AS freq_w4,
    SUM(CASE WHEN time_window = 'w4' THEN total_play_time ELSE NULL END) AS play_time_w4,
    SUM(CASE WHEN time_window = 'w4' THEN avg_play_pct ELSE NULL END) AS avg_play_pct_w4,
    
FROM
    (
    SELECT 
        uid,
        CASE WHEN date BETWEEN '2017-03-30' AND '2017-04-09' THEN 'w1'
             WHEN date BETWEEN '2017-04-10' AND '2017-04-20' THEN 'w2'
             WHEN date BETWEEN '2017-04-21' AND '2017-05-01' THEN 'w3'
             WHEN date BETWEEN '2017-05-02' AND '2017-05-12' THEN 'w4' END AS time_window,
        device,
        COUNT(1) AS freq,
        SUM(play_time) AS total_play_time,
        AVG(CASE WHEN play_time / song_length  > 1 THEN 1.0 ELSE play_time / song_length END) AS avg_play_pct,    
    FROM Play_new
    WHERE
        date > '2017-03-29'
    GROUP BY 1, 2
    ) sub

GROUP BY uid
""", musicbox_conn)

CPU times: user 3 µs, sys: 2 µs, total: 5 µs
Wall time: 5.96 µs

In [6]:
df_tmp = pd.read_sql("""
SELECT 
    uid,
    CASE WHEN date BETWEEN '2017-03-30' AND '2017-04-09' THEN 'w1'
         WHEN date BETWEEN '2017-04-10' AND '2017-04-20' THEN 'w2'
         WHEN date BETWEEN '2017-04-21' AND '2017-05-01' THEN 'w3'
         WHEN date BETWEEN '2017-05-02' AND '2017-05-12' THEN 'w4' END AS time_window,
    device,
    COUNT(1) AS freq,
    SUM(play_time) AS total_play_time,
    AVG(CASE WHEN play_time / song_length  > 1 THEN 1.0 ELSE play_time / song_length END) AS avg_play_pct,    
FROM Play_new
WHERE
    date > '2017-03-29'
GROUP BY 1, 2
""", musicbox_conn)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 0))

DatabaseError: Execution failed on sql '
SELECT
    uid,
    CASE WHEN date BETWEEN '2017-03-30' AND '2017-04-09' THEN 'w1'
         WHEN date BETWEEN '2017-04-10' AND '2017-04-20' THEN 'w2'
         WHEN date BETWEEN '2017-04-21' AND '2017-05-01' THEN 'w3'
         WHEN date BETWEEN '2017-05-02' AND '2017-05-12' THEN 'w4' END AS time_window,
    device,
    COUNT(1) AS freq,
    SUM(play_time) AS total_play_time,
    AVG(CASE WHEN play_time / song_length  > 1 THEN 1.0 ELSE play_time / song_length END) AS avg_play_pct,
FROM Play_new
WHERE
    date > '2017-03-29'
GROUP BY 1, 2
': near "FROM": syntax error

In [ ]:
churn_df.head()

In [ ]:
churn_df.to_sql('churn', musicbox_conn, if_exists="replace", index=False)

In [ ]:
churn_df = churn_df[(churn_df.freq_w1 > 0) | (churn_df.freq_w2 > 0) | (churn_df.freq_w3 > 0)]

In [ ]:
churn_df.freq_w4 == 0